//
//  dailyTwo.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

import Foundation

// MARK: - 情緒表達 1
let dailyTwo = [
"""
本当に嬉しい
やった！
いい感じですね
すこい
結構です
感動しました
楽しみしている
素晴らしい！
よかったね
すごく面白かったですよ
今日は楽しかったです
幸せだ
優しい人ですね
助かりました
助かった
私に任せて
光栄です
かわい
大丈夫です
わたし、気になります！
""",
// MARK: - 情緒表達 2
"""
悲しいです
痛い
怖い！
辛い！
びっくりした
信じられない
嫌だ！
もう我慢できない
すこく悔しいです
寂しいです
顔を見ないで、恥ずかしいです
もういい！
馬鹿にするな！
想像できない
困って仕方がない
つまらない
私のせいです
構いません
頭が痛いです
体が少したるいです
どうしよう
""",
// MARK: - 邀約/拒絕
"""
晩ご飯一緒にどう
村上くんのライン聞いてもいい？
ライン教えて！
お腹すいたね。ご飯食べにいかない？
ごめん、私はちょっと用事がある
一緒に映画を観に行かない？
いついい？
水曜日と金曜日はダメだったわね
木曜日はどうですか
いいよ、何時ですか
午後七時に会いましょう
動物園に行こう！
どこで会いますか
原宿駅前出会おう
2時頃駅前の喫茶店にしないか
しゃ、そうしよう
そんな深い意味じゃないんだ。友達として
私も行きたいです
新宿駅の南口の改札はどうですか
たぶん10分くらい遅れると思う

"""
]
