//
//  daily.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

// MARK: - 打招呼/日常片語 1
let dailyOne = [
"""
#日常 #打招呼
こんにちは|你好
お元気ですか|你好嗎？
そうですね|沒錯
佐藤さん、最近お元気ですか？|佐藤先生，你最近好嗎？
元気ですよ|我很好
おかげさまで|承蒙你的...
今日は、いい天気ですね|今天天氣真好
おはようございます。|早安
こんばんは|晚安
おやすみなさい|晚安
お久しぶりです|好久不見
どうも|你好
最近はどうなの？|最近如何？
お邪魔します|打擾了。(進入別人家時)
はい、いいですよ|好，可以呦
さようなら|再見
ありがとうございます|十分感謝
失礼します|失禮了。
じゃぁ、お先に|那我先走了。
""",
// MARK: - 打招呼/日常片語 2
"""
#日常
すみません|對不起
ごめんなさい|對不起
はい|是的
いいえ|不是
いや|不
違います|不是這樣的
そうです|就是這樣
いただきます|開動了
ごちそうさまでした|謝謝招待
どうぞ|請
ただいまー|我回來了
お帰りなさい|請回去
お気をつけて|請保重
いってらっしゃい|一路順風
ごゆっくり、どうぞ|請慢慢享用
今、何してるんですか|現在要做什麼
今日はどちらへ？|今天要去哪裡
そうですか|這樣啊
じゃーまた。|那、再見
わかりました|我知道了。
""",
// MARK: - 自我介紹
"""
#日常 #初次見面
初めまして|初次見面
田中と申します|我叫做田中
佐藤です|我是佐藤
本田って呼んでください|請以本田稱呼我
本田さんですね|本田 (確認對方名字)
台湾じんです|我是台灣人
台湾から来た留学生です|我是台灣來的留學生
よろしくお願いします|請多指教
こちらこそ、よろしくお願いします|我也請你多多指教
お名前はなんですか？|你的名子是？
台湾で大学に通っています|在台灣上大學
ご出身はどちらですか|你的出身是？
台湾に来たことがありますか|你有來過台灣嗎？
どこに住んでいるのですか|你現在住在哪裡？
埼玉に住んでいます|我住在琦玉。
日本に来た目的はなんですか？|來日本的目的是什麼？
観光です。|來玩/旅遊。
日本に来てどれくらいですか？|會在日本待多久？
いつ台湾に帰るんですか？|什麼時候回台灣？
帰る日は三月一日です|三月一日回去。
来週の水曜日です|下週三
仕事はなんですか|你的工作是什麼？
趣味は旅行です|興趣是旅行。
""",
// MARK: - 天氣
"""
#日常 #天氣
今日はいい天気ですね|今天天氣真好。
明日、晴れるかな|明天會是晴天嗎？
雨が降りそうですね|好像快下雨了
雨が降っています|正在下雨
最近、雨の日が多くて、嫌ですね|最近都是雨天、真討厭。
今朝は風が強いです|早上風很強
今日は暑いです|今天真熱。
夏になると、むし暑くなる|一到夏天，就很悶熱
寒いですね|好冷啊。
昨日は曇りでした|昨天是陰天。
どうして曇っている|為什麼是陰天啊...
晴れていても、だんだん雲が多くなって|說是要放晴、但雲變的越來越多
こんな日はお散歩に行きたくなるね|這種日子會想出去散步呢
日差しが強いね|陽光真強
日差しが強すぎ|陽光太強了
昨日、最高気温が35度を超えました|昨天最高氣溫超過35度了
今夜、雪が降りそうです|今晚會下雪的樣子
梅雨の時季が始まります|梅雨季節開始了。
今年は台風が多い|今年很多颱風
明日は台風が来るらしい|明天好像颱風會來
""",
"""
#日常 #時間
去年は雪が多かった。|去年雪很多。
今年の冬は寒い。|今年冬天很冷
来年は会えるでしょう。|明年再見吧。
4月1日です。|四月一日。
先月引っ越しました。|上個月搬來的。
月末に近づいている。|快到月末了。
先週それを買いました。|上週買了那個。
今週はよく働いた。|這週努力工作了。
会議は来週までのびた。|會議延長到下週了。
今朝地震があった。|今天早上有地震。
彼は午前中に起きた。|他上午起床了。
夕方の五時です。|傍晚的五點。
昨夜はとても楽しかった。|昨天晚上真開心。
週末はどうだった？|週末過得怎樣啊？
もうすぐ夏休みです。|馬上就是暑假了。
彼は9時だと言った。|他說了是九點。
夏の暑さがやってきた。|夏天的熱度終於到了。
秋には木の葉が落ちる。|秋天會落葉。
冬休みまであとわずかだ。|快要到寒假了。
"""
]
