//
//  extension.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

import Foundation

// MARK: - 再說一次
let interaction = [
"""
#互動
もう一度お願いします|請你再說一次
もう一回いいですか？|再說一次好嗎
それって、どういう意味ですか？|那個、是什麼意思
もう一度言ってくれませんか？|能再跟我說一次嗎
今なんと言いましたか？|剛剛你說了什麼
今聞き取れませんでした。|剛剛沒聽清楚
すみません、なんと言いましたか？|不好意思，你說了什麼
もう少しゆっくり話してくれませんか？|能說慢一點嗎
もう少し大きな声で話してくれませんか？|能大聲一點嗎
すみませんが、もう一度言ってくれませんか？|不好意思、能再跟我說一次嗎？
""",
// MARK: - 延伸話題　google 相槌
"""
#互動
私もです。|我也...
それはつらかったでしょう。|那真的很辛苦對吧
うんうん|嗯嗯
私もそう思います|我也這樣認為
よくわかります|我懂、我懂
さずか、田中さん|不愧是田中先生
いいね！|真棒
いいですね|真棒
まさか！|怎麼會...
ですよね！|就是說啊
すごいね！|真厲害
その後は、どうするのか|那個之後，做了什麼？
そのとおりです|如你所說的
なるほどね|原來如此
いいんじゃない|沒什麼不好的
似合うと思うよ|我覺得很適合喔
それでも、大変ですね|就算那樣，也是很不得了耶
たしかに|的確
本当におっしゃる通り。|真的如你所說
うそでしょ。|不會吧！
本当に？|真的嗎？
それは楽しそうですね。|那個看起來很開心耶
それはつらかったでしょう。|那很辛苦吧

"""
]
