//
//  love.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

let love: [String] = [
// MARK: - デート
"""
なんで
好きなんだよ
好き
俺で良ければ付き合ってほしいな
照れちゃた
照れでない
緊張した
ソフトクリーム大好き
かき氷とか好きかも
いいな〜
もう終わり
寂しいなんか
確かに
せっかくだからこれやろう？
なに？なに？
""",
// MARK: - 稱讚
"""
今日の服かわいい
どこで買った？
古着屋さん
古着っぽい、カワイイ
可愛かった
行って良かった
嬉しい
今日は一日、あの僕とデートしてくれて
ありがどうございました
後、大したもんしゃないけと
今日の感想を書いた手紙
お手紙嬉しい
ビックリした
すこい嬉しかったです
今日はホント１日ありがとう
幸せでした
こんなことしたことない
めちゃカワイ
あ、ちょうどいい
あ、いい感じ
めっちゃキュンキュンした
"""
]

private let n = """
大成功
つづく
えっ、やろう
怖い怖い怖い
さっき言ってたやつ
恋人見たい
もったない
じゃあ一回さこっちに来て
ここで絶対後ろ振り向かないで
振り向いちゃダメだよ
どういうことで
"""
