//
//  love.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

let love: [String] = [
// MARK: - デート
"""
#戀愛
なんで
好きなんだよ
好き
俺で良ければ付き合ってほしいな
照れちゃた
照れでない
緊張した
ソフトクリーム大好き
かき氷とか好きかも
いいな〜
もう終わり
寂しいなんか
確かに
せっかくだからこれやろう？
なに？なに？
""",
// MARK: - 稱讚
"""
#戀愛
今日の服かわいい
どこで買った？
古着屋さん
古着っぽい、カワイイ
可愛かった
行って良かった
嬉しい
今日は一日、あの僕とデートしてくれて
ありがどうございました
後、大したもんしゃないけと
今日の感想を書いた手紙
お手紙嬉しい
ビックリした
すこい嬉しかったです
今日はホント１日ありがとう
幸せでした
こんなことしたことない
めちゃカワイ
あ、ちょうどいい
あ、いい感じ
めっちゃキュンキュンした
""",
// MARK: - 告白
"""
#戀愛
えと、まず。六日間ありがどうございました。
こちらこそ
第一印象から、ずっとOOのことが気になってて
でも、OOに言って無かったけど
正直二日目とか、自分の気持ちをわからなくなって
ちょっと、悩んだ時期もあったんけど
OOに会われへんかった一週間とか
皆と会いたい気待ちがなくて、OOと会いたい気持ちがあって、ずっと
三日目と四日目、初めて手を繋いたりして
いっぱい二人で過ごして、って、気になってるの気持ちはもうなくなって
好きでいう気持ちしか、なかったです
俺はOOと、でもいくとか泣くやんくらい
どうなんどころ行きたいと思っている
って、いっぱい思い出を作りたいと思いている
俺は、OOのことが、大好きです。
良かったら、俺と付き合ってほしい。
えと、六日間というすごく短い期間だったけど
私もはじめで大阪城であった時から
ずっと、XX君のことが気になっていました
はい、けど、六日間だけじゃん
知れってないことがまだまだたくさんあるので
これから、なんだろう、知れなかったことを
たくさん知って、いければいいなってと思っています
私で良かったら、お願いします。お願いします。
ありがどう。お願いします。
行こうか
"""
]

private let n = """
大成功
つづく
えっ、やろう
怖い怖い怖い
さっき言ってたやつ
恋人見たい
もったない
じゃあ一回さこっちに来て
ここで絶対後ろ振り向かないで
振り向いちゃダメだよ
どういうことで
"""
