//
//  expressive.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

//論述
let speech: [String] = [
// MARK: - と思う
"""
#論述 #思う
出来ると思います。|我覺得可行。
俺はいいと思う。|我覺得不錯。
無料だと思った。|我以為是免費的。
彼は誰だと思う？|你以為他是誰？
彼は来ないと思う。|我覺得他不會來。
うまく行くと思うよ。|我覺得一切會順利。
何をしてたと思う？|你覺得我做了什麼？
彼は正しいと思う。|我覺得他是對的。
どれが正しいと思う？|你覺得哪一個是對的？
大きすぎると思います。|我認爲太大了。
それは違うと思います。|我認為那個有錯。
行くべきだと思います。|我認為應該執行。
これは高すぎると思います。|我認爲這個太昂貴了。
大変苦労なさったと思います。|我能想像你吃了很多的苦。
それはいいアイディアだと思います。|我認為那是個好點子。
おそらく、あなたが正しいと思います。|恐怕你是正確的。
この会社は誰が引き継ぐと思う？|你認為誰會繼承這個公司？
今日の午後は雨が降らないと思う。|我覺得今天下午不會下雨。
もう若くないと思うと悲しいです。|對我已經不再年輕感到悲傷。
""",
// MARK: - 比較、原因
"""
#論述 #比較 #原因
自転車より車のほうが早いです。|比起腳踏車、自動車比較快。
学校の生徒はおとなにくらべて2倍も風邪をひく。|學校的學生感冒的機率大概是成人的兩倍。
タダほど高いものはない。|沒有比免費更貴的東西。
あとどのくらいで仕上げなければならないの？|之後還剩下多少時間來完成這個？
退屈するどころか、とても楽しかった。|一點都不無聊，超有趣的。
予想に反して楽に勝てましたね。|和預測的不同，我們輕易地獲勝了。
魚釣りに行くよりも家にいたい。|比起去釣魚，我更想宅在家裡。
憂いの反面には喜びがあるものだ。|即使是擔憂的事，也有令人開心的一面。
昨年は雨が多く米は不作だった。|去年因為雨量太多，稻米歉收了。
大雨で川があふれた。|因為大雨，河川的水都溢出來了。
あなたが女の子だからよ。|那是因為妳是女生。
暑くて彼は眠れなかった。|太熱了，他睡不著。
以前と比べるとよくなった。|和之前相比，已經變好了。
遅くなったので家に帰った。|太遲了，所以我就回家了。
そのうわさは事実にもとづかない。|那個謠言沒有事實為根據。
""",
// MARK: - から、あるし
"""
#論述 #から #あるし
眠いから帰ります。|因為想睡，我先回去了。
知らない方がいい事もあるし。|不知道、有時反而是一件好事。
文化は国々によって異なる。|依據國家，文化也會不同。
制服は学校によって違う。|依據學校，制服也會不同。
嵐によって多くの人が死んだ。|因為暴風雨，死了很多人。
だからこそ、車で行くなといったんですよ。|正因為如此，我說了不可以坐車去。
通り雨だからすぐ止むよ。|是午後陣雨，所以很快就停了。
あなたのおかげで旨く行きました。|我的成功都歸因於你。
彼は日本語を話すことができる。|他會說日語。
暑いと牛乳は腐りやすい。|天氣熱的話，牛奶很快就會腐敗。
日本語は外人にとって覚えにくい。|對外國人來說，日文很難學。
たとえ彼は忙しくても来るよ。|即時他很忙、他還是會來喔。
実は、この映画を観たことがある。|其實，我看過這部電影了。
甘い話にだまされる人もいる。|也有被好話欺騙的人。
退職して幸福とはいえない。|退休並不代表幸福。
金持ちが幸せとは限らない。|有錢不一定就是幸福。
赤字は徐々に減少している。|赤字正慢慢地減少。
こうして彼は成功した。|因此他成功了。
こうしてその偉大な帝国が生まれた。|因此偉大的帝國誕生了。
彼は未婚だけど子供がいた。|雖然他未婚, 但有小孩了。
夏好きだけど、暑さにたえられない。|雖然我喜歡夏天，但對熱天沒輒。
""",
//
"""
#論述 #但是 #如果
どっちにしても、厄介ですね。|不管怎麼做都很麻煩啊。
貧しいといえども彼女は幸せだ。|雖然很窮，但她很幸福。
もし気にさわったら、ごめん。|如果傷到了你的心，很抱歉。
行きたくないのなら、行くな。|如果不想去就別去。
貧しかったらどうしよう。|如果我很窮怎麼辦才好？
やってみれば旨く行くよ。|試著去做的話一切都會順利的。
彼が来るかどうか疑問だ。|我對他會來、有疑問。
景色もすばらしいはずよ。|景色應該會很棒。
今日は雨が降るでしょう。|今天應該會下雨吧。
地球の自転が止まったら、いったいどうなるんだろう。|如果地球停止轉動，究竟會發生什麼呢？
走らなければ間に合わない。|如果不跑起來的話，會趕不上。
誤りはたとえあるとしても少ない。|就算有錯也只有一點點。
彼はもう着いてるはずだ。|他現在應該已經到了。
試合に負けたはずがない。|比賽應該不會輸。
徒歩5分以内に着くはずです。|走五分鐘以內應該就會到。
この手の雑誌は若者に害を与えかねない。|這種雜誌恐怕會對年輕人有不良影響。
きっと彼はそれに失敗をするさ。|我猜他一定會失敗。
世間の思惑など気にするな。|別在意其他人的想法。
船は今にも沈みそうであった。|現在就算船會沉都不奇怪了。
今にも大地震が来そうなのです。|現在隨時都有大地震的可能。
""",
"""
#論述 #說到 #根據
幸福というのはなんですか。|所謂的幸福是什麼？
水と言うものは不思議なものだ。|水這個東西真是不可思議啊
物には限界というものがある。|每件事都有它的極限。
夏といえば何を連想しますか。|說到夏天會聯想到什麼？
私といえば、こちらの方がすきだ。|對我來說，這個方向的話比較喜歡。
12歳といえば犬は年寄りだ。|對狗來說，12歲就已經是老年了。
人によって意見が異なる。|人不同，意見也會不同。
天候は季節によって変わる。|天氣依據季節而變化。
新聞によると台風がやってくる。|新聞說颱風要來了。
天気予報によると明日は晴れです。|根據天氣預報明天會是晴天。
彼は朝から晩まで働いた。|他從早到晚都在工作。
初めから終わりまで楽しかった。|從頭到尾都樂在其中。
ここから町までずいぶんあるようだ。|從這裡到城市有一大段距離。
テレビを修理に出さなければならない。|我不得不修好電視。
落ち着かなくてはいけない。|不可以不冷靜。
バスには切符が必要だ。|搭公車一定要有車票。
薬を飲まなくてはいけません。|不可以不吃藥。
"""/*,
"""
#論述 #從...來看
イギリスを例にとって見よう。|以英國為例來看
電気が蒸気にとって代わった。|電力代替了蒸氣
水は人間にとって大切だ。|水對人類來說很重要。
彼は実業家としてはやり手だ。|作為一個企業家，他很上手。
彼は怠け者として首になった。|他因為偷懶被開除了。
今頃にしては暖かい。|對這個時節算是溫暖的。
時間を無駄にしてはいけない。|不能浪費時間。
これは事実に基づいている。|這個有事實為根據。
彼の議論は事実に基づいたものだった。|他的意見是基於事實的。
彼の思想は彼の体験に基づいている。|他的想法是基於他自身經驗來的。
彼はその本から大きな利益を得た。|他從那本書得到很大的利益。
若い女性はその老人に追いかけられる。|年輕的女性被那個老人追趕。
彼は私に社長の地位を約束した。|他答應了我、社長的位子。
この習慣はアメリカ独特のものである。|這個是美國獨有的習慣。
言い換えれば、それは常識の問題である。|換句話說，那是常識的問題。
しかし君はそこにいない。|但是你不在那裡。
しかし、人間はちがっている。|但人類是不同的。
だが宇宙は無限だ。|但宇宙是無限的。
そして、男の子はそうしました。|然後男孩說了謊。
そして歴史は永久に変わった。|然後歷史永遠的改變了。
それでも、おまえは人間だ。|即使如此，你只是一個人。
それでいつも健康だったんだね。|所以你總是很健康。
それには疑問の余地が全然ない。|對於那個，沒有任何的疑問。
"""*/
]
