//
//  expressive.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

//論述
let speech: [String] = [
// MARK: - と思う
"""
#論述
晴れだと思うよ。
出来ると思います。
俺はいいと思う。
無料だと思った。
彼は誰だと思う？
彼は来ないと思う。
うまく行くと思うよ。
何をしてたと思う？
彼は正しいと思う。
どれが正しいと思う？
大きすぎると思います。
それは違うと思います。
ええ、行くべきだと思います。
これは高すぎると思います。
大変苦労なさったと思います。
それはいいアイディアだと思います。
おそらく、あなたが正しいと思います。
この会社は誰が引き継ぐと思う？
今日の午後は雨が降らないと思う。
もう若くないと思うと悲しいです。
""",
// MARK: - 比較、原因
"""
#論述
自転車より車のほうが早いです。
学校の生徒はおとなにくらべて2倍も風邪をひく。
タダほど高いものはない。
我が家ほどいいものはない。
あとどのくらいで仕上げなければならないの？
退屈するどころか、とても楽しかった。
雨はやむどころかいよいよひどくなった。
円はドルに対して高くなった。
予想に反して楽に勝てましたね。
魚釣りに行くよりも家にいたい。
憂いの反面には喜びがあるものだ。
昨年は雨が多く米は不作だった。
大雨で川があふれた。
あなたが女の子だからよ。
暑くて彼は眠れなかった。
以前と比べるとよくなった。
死はよく眠りにたとえられる。
遅くなったので家に帰った。
そのうわさは事実にもとづかない。
それは実際君の所為である。
""",
// MARK: - から、あるし
"""
#論述
眠いから帰ります。
知らない方がいい事もあるし。
文化は国々によって異なる。
制服は学校によって違う。
嵐によって多くの人が死んだ。
だからこそ、車で行くなといったんですよ。
通り雨だからすぐ止むよ。
あなたのおかげで旨く行きました。
それ以上は望む方が無理ですよ。
彼は日本語を話すことができる。
暑いと牛乳は腐りやすい。
木造の建物は火事になりやすい。
日本語は外人にとって覚えにくい。
彼は若いけれど利口だ。
陽は出ていたけれど、寒かった。
今出かけるのには遅すぎる。
今は判断しなくてもいいんだ。
たとえ彼は忙しくても来るよ。
実は、この映画を観たことがある。
甘い話にだまされる人もいる。
退職して幸福とはいえない。
""",
//
"""
#論述
どっちにしても、厄介ですね。
いずれにしても彼は来るだろう。
貧しいといえども彼女は幸せだ。
君の指摘、中らずといえども遠からずだね。
もし気にさわったら、ごめん。
わかったら手を挙げなさい。
行きたくないのなら、行くな。
貧しかったらどうしよう。
やってみれば旨く行くよ。
彼が来るかどうか疑問だ。
景色もすばらしいはずよ。
今日は雨が降るでしょう。
地球の自転が止まったら、いったいどうなるんだろう。
走らなければ間に合わない。
誤りはたとえあるとしても少ない。
彼はもう着いてるはずだ。
試合に負けたはずがない。
徒歩5分以内に着くはずです。
この小屋は倒壊のおそれがある。
この手の雑誌は若者に害を与えかねない。
""",
"""
#論述
事故というのは起こるものだ。
幸福というのは何ですか。
水というものは不思議なものだ。
物には限界というものがある。
夏といえば何を連想しますか。
私といえば、こちらの方がすきだ。
12歳といえば犬は年寄りだ。
人によって意見が異なる。
天候は季節によって変わる。
価格が需要によって変わる。
新聞によると台風がやってくる。
天気予報によると明日は晴れです。
彼は朝から晩まで働いた。
初めから終わりまで楽しかった。
ここから町までずいぶんあるようだ。
テレビを修理に出さなければならない。
医者を呼びにやるべきだ。
落ち着かなくてはいけない。
バスには切符が必要だ。
薬を飲まなくてはいけません。
""",
"""
#論述
イギリスを例にとって見よう。
電気が蒸気にとって代わった。
水は人間にとって大切だ。
彼は実業家としてはやり手だ。
彼は怠け者として首になった。
鶏に種を、えさとして与える。
今頃にしては暖かい。
時間を無駄にしてはいけない。
男同士にしては変に仲がいいね。
これは事実に基づいている。
この映画は小説をもとにしている。
彼の議論は事実に基づいたものだった。
彼の思想は彼の体験に基づいている。
非核武装を中心にした話し合い。
彼はその本から大きな利益を得た。
若い女性はその老人に追いかけられる。
彼は私に社長の地位を約束した。
満ち足りた心は永遠の祝宴である。
この習慣はアメリカ独特のものである。
言い換えれば、それは常識の問題である。
株式市場は長い不振を続けている。
しかし君はそこにいない。
しかし、人間はちがっている。
だが宇宙は無限だ。
だが君は間違っている。
水が不足すると不自由する。
そして、男の子はそうしました。
そして歴史は永久に変わった。
それでも、おまえは人間だ。
それでいつも健康だったんだね。
それには疑問の余地が全然ない。
きっと彼はそれに失敗をするさ。
人の尻馬などに乗るな。
世間の思惑など気にするな。
船は今にも沈みそうであった。
今にも大地震が来そうなのです。
金持ちが幸せとは限らない。
皆が不正直とは限らない。
騒音は徐々に減少した。
赤字は徐々に減少している。
こうして彼は成功した。
こうしてその偉大な帝国が生まれた。
彼は未婚だけど子供がいた。
夏好きだけど、暑さにたえられない。
"""
]























