//
//  grammarN4.swift
//  sentencesVerifier
//
//  Created by Wangchou Lu on 12/26/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//
// swiftlint:disable file_length
let grammarN4 = [
"""
#N4 #文法14
おみやげを くださる|給紀念品。
私に おみやげを くださいました。|給了我紀念品。
せんぱいが 私に おみやげを くださいました。|前輩給了我紀念品。

窓を しめる|關上窗戶
窓を しめてく ださい|請關上窗戶
だれが 窓を しめてく ださい|誰來幫忙關上窗戶

おきゃくさんが 来る|客人會來
おさらを ならべる|排列盤子
おさらを ならべて おく|排列放好盤子
テーブルの上に おさらを ならべて おきます。|在桌上排列放好盤子
おきゃくさんが 来るから テーブルの上に おさらを ならべて おきます。|因為客人要來，在桌上排列放好盤子。

写真を とる|拍照
写真を とっては だめだ|不能拍照。
写真を とっちゃ だめだ|不能拍照。
ここで、写真を とっちゃ だめだよ。|不能在這裡拍照。

小学校に 通う|上小學
小学校に 通い はじめる|開始上小學
6才から 小学校に 通い はじめる。|從6歲開始上小學。
""",
"""
#N4 #文法6
カーテンを 開ける|打開窗簾
海が見える|可以看見大海
カーテンを 開けると  海が見えました。|打開窗簾，看見了大海。

食べる|吃
食べられる|能吃
何でも 食べられます|能吃任何東西
私は 何でも 食べられます。|我可以吃任何東西。

スーパーまで 行く|到超市去
ちょっと スーパーまで 行ってきます|到超市去一下再回來

のどが いたい時|當喉嚨痛時
歌を 歌わない|不唱歌
のどが いたい時は 歌を 歌わない|當喉嚨痛時、不唱歌
のどが いたい時は 歌を 歌わない ほうがいい ですよ。|當喉嚨痛時、不要唱歌比較好。

作る|製作
作り方を教えて|教我製作的方法
料理の 作り方を教えて ください。|請教我料理的製作方法。
あなたの 国の 料理の 作り方を教えて ください。|請告訴我如何製作你的國家的料理。

どこで とったんですか。|在哪拍的？
その写真は どこで とったんですか。|那張照片是在哪裡拍的？
""",
"""
#N4 #文法4
じこが ある|有事故
じこが あった ために|因為有事故
じこが あった ために、道が こんでいます。|因為有事故，馬路很塞。

帰る|回來
お父さんは 帰られる|爸爸回來了 (敬語)
お父さんは 何時に 帰られましたか。|爸爸什麼時候回來的？

テストが あるので|因為有考試
おそくは こまります。|弄到太晚會很困擾
朝 テストが あるので、夜 おそくは こまります。|因為早上有考試、晚上弄到太晚會很困擾

きょうみがある。|有興趣。
じゅうどうにきょうみがあります。|對柔道有興趣。

さとうが 入れる|放入砂糖
さとうが 入れてあります。|放了砂糖
コーヒーに さとうが 入れてあります。|放了砂糖在咖啡裡。

注意する|注意
注意される|被注意
注意されてしまった|結果被關注了
私は 注意されてしまいました。|結果被關注了。
私は、かいぎにおくれて 注意されてしまいました。|我會議遲到了，因此被關注了。
""",
"""
#N4 #文法5
えんりょなく|不要客氣
使います|使用
お使いください。|請使用。
どうぞ、えんりょなく お使いください。|不要客氣、請使用。

歩く|走路
歩きすぎる|走太多
ハイキングで 歩きすぎて|爬山時路走太多
足が いたい|腳很痛
足が いたくなる|腳變的很痛
足が いたくなりました。|腳變的很痛了
ハイキングで 歩きすぎて、足が いたくなりました。|爬山時路走太多、腳變的很痛

歌を歌う|唱歌
歌を歌っている|正在唱歌
だれかが 歌を歌っているの|有人在唱歌
だれかが 歌を歌っているのが 聞こえます。|聽到有人在唱歌。

山田さんという人|叫做山田先生的人
山田さんという人が いますから|有叫做山田先生的人在
その人に これを わたす|把這個傳給那個人
じむしょに 山田さんという人が いますから、その人に これを わたして ください。|事務所裡有叫做山田先生的人，請把這個交給那個人。
""",
"""
#N4 #文法8
テレビを 見る|看電視
テレビばかり 見ていると|一直看電視、結果
目が 悪い|眼睛很差。
目が 悪く なりました|眼睛變的很差。
テレビばかり 見ていると、 目が 悪く なりました。|一直看電視，結果眼睛變的很差。

急いでいる|在趕時間
急いでいるので|因為在趕時間
急いでいるので、すぐ 帰ります。|因為在趕時間，馬上就會回來。

こしょうするし、音が 悪いから|因為故障，聲音又糟糕
ラジオは 新しいのを 買いたい。|想買一台新收音機。
この ラジオは よく こしょうするし、音が 悪いから 新しいのを 買いたい。|這個收音機經常故障、聲音又很糟，所以想買一個新的

冬でも あたたかい|即使冬天也很溫暖
この へんは 冬でも あたたかい 所です。|這附近是即使冬天也很溫暖的地方

わかる|理解
わかりにくい|很難理解
ずいぶん わかりにくい 地図ですね。|是相當難以理解的地圖呢。

むずかしい|難
むずかしそうな|看起來很難
むずかしそうな 本を 読む|讀看起來很難的書
田中さんは むずかしそうな 本を 読んで います。|田中先生正在讀看起來很難的書。
""",
"""
#N4 #文法3
わからない|不知道
わからなければ|如果不知道
書かない|不要寫
書かなくても|即使不寫
わからなければ 書かなくても いいです。|如果不知道的話，不寫也沒關係

ゆめの ような|像夢一般的
そうだと 思います。|我是這麼認為的。
そんな ゆめの ような 話は そうだと 思います。|我認爲這像夢一般的故事是真的。

じゅんびをする|準備
じゅんびをして おく|事前準備
いろいろ じゅんびをして おきました。|做了各種事前準備。
パーティーのために いろいろ じゅんびをして おきました。|為了聚會做了各種事前準備

「いただきます」と いって|說“開動了”
食べる|吃
食べ 始まる|開始吃
食べ 始めました。|開始吃了。
みんなは 「いただきます」と いって 食べ 始めました。|大家說“開動了”、然後開始吃了。

ここに 集まること|在這裡集合
ここに 集まること になっているの|現在該在這裡集合
ここに 集まること になっているの ですが、だれも いませんね。|現在該在這裡集合，但誰都不在。
""",
"""
#N4 #文法19
三日 練習して|練習三天後。
できるように なる|變得能
運転できるように なりました。|變得能開車了。
三日 練習して 少し 運転できるように なりました。|練習三天後，變得能開車些了。

医者になる|成為醫生
私は 医者になる つもり です。|我想成為醫生。
私は しょうらい 医者になる つもり です。|我將來想成為醫生。

母は 水を やります。|媽媽澆水。
毎朝 にわの 花に|每天早上對庭院的花
母は 毎朝 にわの 花に 水を やります。|媽媽每天早上對庭院的花澆水。

いい におい|好香
いい においが する|聞起來好香
この せっけんは いい においが します。|這個肥皂聞起來很香。

そうじを てつだう|幫忙打掃
先生は そうじを てつだわせる|老師要我幫忙打掃
先生は 学生に 研究室の そうじを てつだわせました。|老師要學生幫忙打掃了研究室

ちょっと 用事が あるので|因為有點事
おさきに しつれいします。|要先離開
ちょっと 用事が あるので おさきに しつれいします。|因為有點事，要先離開。
""",
"""
#N4 #文法10
ざっしでも 読んで|讀雜誌之類的
待っている|在等待
待っていて ください|請等待
そこに ある ざっしでも 読んで、待っていて ください。|請閱讀那裡的雜誌之類的來等待。

料理は かんたんだ|料理很容易
料理は かんたんなので|因為料理很容易
この 料理は かんたんなので、よく 作ります。|因為這道料理很容易，所以經常做。

楽しい|開心
子供たちは 楽しそう|孩子看起來很開心
遊ぶ|玩
遊んでいます|正在玩
子供たちは 楽しそう に 遊んでいます。|孩子們看起來玩得很開心中。

ひるまの ように|像白天一樣
東京は 夜でも ひるまの ように 明るいですね。|在東京、即使是夜晚也像白天一樣明亮呢

中国語が できる|會說中文
中国語が できるらしい です。|似乎會說中文。
田中さんは 中国語が できるらしい です。|田中先生似乎會說中文。

生活します|生活
生活しやすい  所だ|容易生活的地方
東京は 生活しやすい  所だと 思いますか。|覺得東京是容易生活的地方嗎？
""",
"""
#N4 #文法13
あなたの かぎです|你的鑰匙。
どれが あなたの かぎですか。|哪一個是你的鑰匙？

7時までに 来て ください。|請7點之前來。
明日は あさ 7時までに 私の所に 来て ください。|請明天早上7點之前來我的地方。

雨も ひどかった|雨很大。(過去式)
風も 強かった|風很強。(過去式)
昨日は 雨も ひどかったし、風も 強かったです。|昨天雨很大，風也很強。

昨日より あたたかい|比昨天溫暖
今日は 昨日より あたたかい ですね。|今天比昨天溫暖呢。

おさけを 飲む|喝酒
あまり おさけを 飲まない|不太喝酒。
あまり おさけを 飲まない ように|不要喝太多酒
田中さんに 言ってください。|請告訴田中先生。
田中さんに あまり おさけを 飲まない ように 言ってください。|請告訴田中先生不要喝太多酒。

本を 読む|讀書
本を 読んでいる|正在讀書
本を 読んでいた人|正在讀書的人
さっき ここで 本を 読んでいた人は だれですか。|誰是之前在這裡讀書的人？

おいしそうな|看起來很好吃
つくえの 上に おいしそうな りんごが あります。|桌上有看起來很好吃的蘋果。
""",
"""
#N4 #文法12
めがねを かける|戴眼鏡
めがねを かけた まま|戴著眼鏡
ねて しまった|不小心睡著了
昨日は めがねを かけた まま  ねて しまいました。|昨天不小心戴著眼鏡睡著了。

たばこを すう|抽煙
たばこを すっては いけません|不可以抽煙
ここで たばこを すっては いけません。|這裡禁止抽菸

外国へ 行く らしい|似乎是出國。
昨日 外国へ 行った らしい|昨天似乎出國了。
田中さんは 昨日 外国へ 行った らしい です。|田中先生昨天似乎出國了。

入院する|住院
父に 入院されて|被父親送去住院
父に 入院されて、私は とても こまっています。|被父親送去住院、我感到相當為難

聞いて|聽著
聞いても わかりません。|即使聽了，也不明白。
あの 人の 話は 何回 聞いても わかりません。|那個人的話無論聽多少次，我都不明白。

ニュースに よると|根據新聞
じしんが ある|發生了地震
じしんが あった そうです。|似乎發生了地震。
ニュースに よると、きのう 東京で じしんが あった そうです。|根據新聞，昨天東京似乎發生了地震。
""",
"""
#N4 #文法17
みんなは 私を 笑いました|大家嘲笑我
みんなに わらわれました。|我被大家嘲笑。(被動式)
私は へんなことを 言って、みんなに わらわれました。|我說奇怪的話後、被大家嘲笑了。

どんなに 練習しても|不管怎麼練習
うまく なる|變好
どんなに 練習しても、テニスが うまく なりません。|不管怎麼練習，打網球都沒有變強。

来月 旅行します。|下個月要旅行。
その 時は 車で 行きます。|那時會開車去。
来月 旅行します。その 時は 車で  行きます。|下個月要旅行。那時會開車去。

外国へ 行く|出國
外国へ 行った こと|出國過
私は 一度も 外国へ 行った ことがありません。|我從未出國過。

小説家に なる|成為小說家
しょうらいは 小説家に なる つもり です。|將來打算成為小說家。

コーヒーか何か どうですか。|咖啡之類的如何？
コーヒーでも いかがですか。|咖啡之類的如何？(敬語)
いっしょに コーヒーでも いかがですか。|一起喝杯咖啡之類的如何？

中川と 言います。|叫做中川。
中川と もうします。|叫做中川。(謙讓語)
私は 中川と もうします。|我叫做中川。(謙讓語)
""",
"""
#N4 #文法18
聞いた ことがありません。|沒有聽說過。
日本の 音楽は まだ 聞いた ことがありません。|還沒有聽過日本音樂。

べんりなので|因為很方便
よく 使います。|經常使用。
べんりなので、よくパソコンを 使います。|因為方便，經常使用電腦。

パンをやく|烤麵包
これから パンをやく ところ です。|接下來是烤麵包的時候了。

できる かどうか|是否能夠
そつぎょうできた かどうか|是否能夠畢業
中田さんが 大学を そつぎょうできた かどうか 知っていますか。|你知道中田先生大學能不能畢業嗎？

どこに いるか|在哪裡？
田中さんが どこに いるか わかりません。|我不知道田中在哪裡。

パーティーをする|舉辦派對
パーティーをする こと になる|將舉辦派對
来週 パーティーをする こと になったんです。|下週決定舉辦派對了。

スプーンとか ナイフとか|湯匙啊、叉子啊之類的
ひきだしには スプーンとか ナイフとかが 入っています。|抽屜裡放有湯匙啊、叉子啊之類的。

どちらが 近いですか|哪個比較近？
この 大学と あの 大学と どちらが 近いですか。|這所大學或那所大學、哪個比較近？
""",
"""
#N4 #文法20
土曜日に して もらえませんか|星期六可以嗎？
土曜日に して いただけませんか。|星期六可以嗎？(謙讓語)
火曜日、木曜日、土曜日に して いただけませんか。|週二，週四，週六可以嗎？(謙讓語)

気をつけている|小心
気をつけていたのに|雖然很小心了、可是
パスポートを なくして|護照不見了
気をつけていたのに、パスポートを なくしてしまいました。|雖然很小心了，可是結果護照還是不見了。

電話するように|要打電話
かならず 電話するように 言って下さい。|請告訴他務必要打電話。

100以上も あります。|有100多個。(強調)
東京には 大学が 100以上も あります。|東京有100多所大學。

名前を つける|取名字
名前を つけて くれる|給它取個名子
私に 名前を つけて くれたのは おじいさんです。|幫我取名的是叔叔。

大学生の 子どもが います|有個大學生的孩子
あの人は 大学生の 子どもが いますが、そうは 見えません。|那個人有個大學生的孩子，真看不出來。

パーティーが あるかどうか|是否有派對
今晩 パーティーが あるかどうか  教えて ください。|請告訴我、今晚有沒有派對。

終わったら|完成後
仕事が 終わったら、電気を けして ください。|完成工作後請關燈。
""",
"""
#N4 #文法11
「うみ」と言う|唸作“海”
どう 書きますか。|怎麼寫？
「うみ」と言う 漢字は どう 書きますか。|唸作“海”的漢字，怎麼寫？

窓を 開けた まま|窗戶開著
窓を 開けた まま  ねたので|因為窗戶開著就睡著
かぜを ひく|感冒
かぜを ひいて しまいました。|結果感冒了。
きのうの 夜 窓を 開けた まま  ねたので、かぜを ひいて しまいました。|昨天晚上窗戶開著就睡著，結果感冒了。

頭が いたい|頭痛
ねつが ある|發燒中
頭が いたいし、ねつが あるから|因為頭痛又發燒中。
頭が いたいし、ねつが あるから、今日は 休みます。|因為頭痛又發燒、今天請假。

たまごの味が する|有雞蛋的味道。
このおかしは、たまごの味がします。|這個點心有雞蛋的味道

読む時、めがねを かけます。|看的時候，戴著眼鏡。
父は 新聞を 読む時、いつも めがねを かけます。|父親在看報紙時、總是戴著眼鏡。

話しても かまいません。|就算說了也沒影響。
ここでは 何を 話しても かまいません。|就算在這裡說了什麼，都沒有影響。

においが する。|聞起來有氣味。
この花、へんな においが します。|這朵花聞起來有怪味道。
""",

"""
#N4 #文法9
食べながら 見ます。|我邊吃邊看。
おかしを 食べながら  映画を 見ました。|我邊吃點心、邊看了電影。

しずか かもしれません。|可能很安靜。
あの きっさてんは しずか かもしれません。|那個咖啡店可能很安靜。

雨が ふる|下雨
雨が ふるらしい です。|好像會下雨。
あしたは 雨が ふるらしい です。|明天好像會下雨。

おとす|遺失
おとした さいふ|遺失的錢包
さいふが ある|有錢包
おとした さいふが あって よかったですね。|找回遺失的錢包真好呢

ひとりで くつが はけるように|一個人自己穿鞋
むすこは ひとりで くつが はけるように なりました。|兒子變得能一個人自己穿鞋了

「きけん」と 書いてあります。|寫著「危險」。
見て ください。あそこに 「きけん」と 書いてあります。|請看。那邊寫著“危險”。

電車を おりる|下電車
電車を おりようと した時|正要下電車時
けがを しました。|受傷了
電車を おりようと した時、ころんで けがを しました。|正要下電車時，摔倒受傷了。
""",
"""
#N4 #文法2
大きな 音が する|聽到很大的聲音。
さっき となりの へやで 大きな 音が しました。|剛才附近的房子傳岀很大的聲音。

行きたい|想去
行きたくない|不想去
行きたくなければ|如果不想去
行かない|不去。
行かなくても いいです。|不去也沒關係。
いっしょに 行きたくなければ、行かなくても いいです。|如果不想一起去的話，不去也沒關係。

ここに来る|過來這裡
ここに来た時|來到這裡的時候
田中さんが あした ここに来た時 聞いてみます。|田中先生明天來到這裡時，問看看。

この漢字は どう 読みますか。|這個漢字怎麼唸？

あそんでいるの|在玩嗎？
子供たちが あそんでいるのが 見えます。|我可以看到孩子們在玩耍。

2階に あります|在二樓。
2階に ございます|在二樓 (謙讓語)
ネクタイ 売り場は 2階に ございます。|領帶的販賣部在二樓。

10分で 行けます。|十分鐘可以到。
大学まで 歩いて 10分で 行けます。|走路十分鐘可以到大學。
""",
"""
#N4 #文法15
れきしを しらべる|調查歷史
この町の れきしを しらべる こと|調查這個小鎮的歷史
図書館で この町の れきしを しらべる ことができます。|在圖書館可以調查這個城鎮的歷史。

病気に なっても|即使生病了
あの 人は 休みません。|不會請假。
あの 人は 会社を 休みませんでした。|那個人也沒有從公司請假。
あの 人は 病気に なっても 会社を 休みませんでした。|即使生病了，那個人也沒有從公司請假。

荷物を 待つ|等待行李
荷物を お待ちします。|等待行李。(謙讓語)
先生、私が 荷物を お待ちします。|老師，我會等行李的。

味が 悪い|味道不好
ねだんが 高い|價格昂貴
味も 悪いし、ねだんも 高い|味道不好，也很貴
この レストランは 味も 悪いし、ねだんも 高いですね。|這家餐廳味道不好，價格也很貴。

旅行は どうだった|旅行怎樣啊？
友だちは「旅行は どうだった」と  私に 聞きました。|朋友問了我“旅行怎麼樣啊？”

おくる|遲到
電車に おくれる|趕不上電車
電車に おくれる。急げ。|會趕不上電車。快一點
""",
"""
#N4 #文法16
家を こわす|破壞房子
家が こわれる|房子被破壞
たくさんの 家が こわれました|許多房屋被破壞了
大きな 地震で たくさんの 家が こわれました。|因大地震許多房屋被破壞了。

朝日が のぼるの|朝陽昇起
私は 朝日が のぼるのを 見ました。|我看到朝陽昇起了。
私は 海で きれいな 朝日が のぼるのを 見ました。|我在海邊看到美麗的朝陽昇起。

旅行のことを 思い出しました。|想起了旅行的事。
楽しかった 旅行のことばかり 思い出しました。|想起了的淨是旅行中快樂的事

借りるなら|如果要借的話
どんな部屋がいいですか。|怎樣的房間好呢？
部屋を借りるなら、どんな部屋がいいですか。|如果要借房間的話，怎樣的房間好呢？

勉強する|學習
勉強したのに|明明學習了
テストのてんが 悪い|考試的分數很差
テストのてんが 悪かったです。|考試的分數很差。
たくさん 勉強したのに、テストのてんが 悪かったです。|明明學習了很多，但考試的分數很差。

さむいです|很冷
きのうほど ではありません。|沒像昨天那樣。
今日は さむいですが、きのうほど ではありません。|雖然今天很冷，但沒像昨天那樣。
""",
"""
#N4 #文法1
飲みます|喝。
お飲みに なります|喝 (尊敬語)
先生は 何を お飲みに なりますか。|老師您要喝什麼？

使います|使用
使い方|使用方法
おはしの 使い方 を 教えて ください。|請告訴我筷子的使用方法。

飲みます|喝。
飲みすぎる|喝太多
おさけを 飲みすぎました|喝了太多酒
きのうは ちょっと おさけを 飲みすぎました。|昨天喝了有點太多的酒。
きのう 新しい レストランへ いってみました。|昨天去看了新的餐廳。

お聞きする|問 (謙讓語)
先生に お聞きしたい|想問老師
先生に お聞きしたいことが あるんですが・・・。|雖然有想問老師的事......

なれる|成為
友だちに なれます|成為朋友
あの 人は だれと でも 友だちに なれます。|那個人可以和任何人成為朋友。
""",
"""
#N4 #文法7
子供が 言う|孩子說
子供に 言われる|被孩子說
たばこを やめることに する|決定戒菸
子供に 言われて、私は たばこを やめることに しました。|被孩子唸了，我決定戒菸了。

飲まない|不喝酒
飲まない ことにする|決定不喝酒
アルコールは もう 飲まない ことにする。|已經決定不喝酒了。

べんりだ|是方便的
新しいので|因為很新
べんりだし、新しいので|因為又方便又很新
このアパートは へや代が 高いです。|這間公寓的租金很貴。
このアパートは べんりだし、新しいので へや代が 高いです。|這間公寓因為又方便又很新，所以租金很貴。

来週の かいぎに|下週的會議
出なくても|即使沒來
来週の かいぎには 出なくても かまいません。|下週的會議即使沒來也沒關係

かぜが 強い|風很強。
かぜが 強いだろう。|應該風會很強。
たぶん あしたも かぜが 強いだろう。|大概明天風也會很強。
"""
]
// swiftlint:enable file_length

