//
//  grammarN4.swift
//  sentencesVerifier
//
//  Created by Wangchou Lu on 12/26/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//
// swiftlint:disable file_length
let grammarN4 = [
"""
#N4 #文法14
おみやげを くださる
私に おみやげを くださいました。
せんぱいが 私に おみやげを くださいました。

窓を しめる
窓を しめてく ださい
だれが 窓を しめてく ださい

おきゃくさんが 来る
おさらを ならべる
おさらを ならべて おく
テーブルの上に おさらを ならべて おきます。
おきゃくさんが 来るから テーブルの上に おさらを ならべて おきます。

写真を とる
写真を とっては だめだ
写真を とっちゃ だめだ
ここで、写真を とっちゃ だめだよ。

小学校に 通う
小学校に 通い はじめる
6才から 小学校に 通い はじめる。
""",
"""
#N4 #文法6
カーテンを 開ける
海が見える
カーテンを 開けると  海が見えました。

食べる
食べられる
何でも 食べられます
私は 何でも 食べられます。

スーパーまで 行く
ちょっと スーパーまで 行ってきます

のどが いたい時
歌を 歌わない
のどが いたい時は 歌を 歌わない
のどが いたい時は 歌を 歌わない ほうがいい ですよ。

作る
作り方を教えて
料理の 作り方を教えて ください。
あなたの 国の 料理の 作り方を教えて ください。

どこで とったんですか。
その写真は どこで とったんですか。
""",
"""
#N4 #文法4
じこが ある
じこが あった ために
じこが あった ために、道が こんでいます。

帰る
お父さんは 帰られる
お父さんは 何時に 帰られましたか。

テストが あるので
おそくは こまります。
朝 テストが あるので、夜 おそくは こまります。

きょうみがある。
じゅうどうにきょうみがあります。

さとうが 入れる
さとうが 入れてあります。
コーヒーに さとうが 入れてあります。

注意する
注意される
注意されてしまった
私は 注意されてしまいました。
私は、かいぎにおくれて 注意されてしまいました。
""",
"""
#N4 #文法5
えんりょなく
使います
お使いください。
どうぞ、えんりょなく お使いください。

歩く
歩きすぎる
ハイキングで 歩きすぎて
足が いたい
足が いたくなる
足が いたくなりました。
ハイキングで 歩きすぎて、足が いたくなりました。

歌を歌う
歌を歌っている
だれかが 歌を歌っているの
だれかが 歌を歌っているのが 聞こえます。

山田さんという人
山田さんという人が いますから
その人に これを わたす
じむしょに 山田さんという人が いますから、その人に これを わたして ください。
""",
"""
#N4 #文法8
テレビを 見る
テレビばかり 見ていると
目が 悪い
目が 悪く なりました
テレビばかり 見ていると、 目が 悪く なりました。

急いでいる
急いでいるので
急いでいるので、すぐ 帰ります。

こしょうするし、音が 悪いから
ラジオは 新しいのを 買いたい。
この ラジオは よく こしょうするし、音が 悪いから 新しいのを 買いたい。

冬でも あたたかい
この へんは 冬でも あたたかい 所です。

わかる
わかりにくい
ずいぶん わかりにくい 地図ですね。

むずかしい
むずかしそうな
むずかしそうな 本を 読む
田中さんは むずかしそうな 本を 読んで います。
""",
"""
#N4 #文法3
わからない
わからなければ
書かない
書かなくても
わからなければ 書かなくても いいです。

ゆめの ような
そうだと 思います。
そんな ゆめの ような 話は そうだと 思います。

じゅんびをする
じゅんびをして おく
いろいろ じゅんびをして おきました。
パーティーのために いろいろ じゅんびをして おきました。

「いただきます」と いって
食べる
食べ 始まる
食べ 始めました。
みんなは 「いただきます」と いって 食べ 始めました。

ここに 集まること
ここに 集まること になっているの
ここに 集まること になっているの ですが、だれも いませんね。
""",
"""
#N4 #文法19
三日 練習して
できるように なる
運転できるように なりました。
三日 練習して 少し 運転できるように なりました。

医者になる
私は 医者になる つもり です。
私は しょうらい 医者になる つもり です。

母は 水を やります。
毎朝 にわの 花に
母は 毎朝 にわの 花に 水を やります。

いい におい
いい においが する
この せっけんは いい においが します。

そうじを てつだう
先生は そうじを てつだわせる
先生は 学生に 研究室の そうじを てつだわせました。

ちょっと 用事が あるので
おさきに しつれいします。
ちょっと 用事が あるので おさきに しつれいします。
""",
"""
#N4 #文法10
ざっしでも 読んで
待っている
待っていて ください
そこに ある ざっしでも 読んで、待っていて ください。

料理は かんたんだ
料理は かんたんなので
この 料理は かんたんなので、よく 作ります。

楽しい
子供たちは 楽しそう
遊ぶ
遊んでいます
子供たちは 楽しそう に 遊んでいます。

ひるまの ように
東京は 夜でも ひるまの ように 明るいですね。

中国語が できる
中国語が できるらしい です。
田中さんは 中国語が できるらしい です。

生活します
生活しやすい  所だ
東京は 生活しやすい  所だと 思いますか。
""",
"""
#N4 #文法13
あなたの かぎです
どれが あなたの かぎですか。

7時までに 来て ください。
明日は あさ 7時までに 私の所に 来て ください。

雨も ひどかった
風も 強かった
昨日は 雨も ひどかったし、風も 強かったです。

昨日より あたたかい
今日は 昨日より あたたかい ですね。

おさけを 飲む
あまり おさけを 飲まない
あまり おさけを 飲まない ように
田中さんに 言ってください。
田中さんに あまり おさけを 飲まない ように 言ってください。

本を 読む
本を 読んでいる
本を 読んでいた人
さっき ここで 本を 読んでいた人は だれですか。

おいしそうな
つくえの 上に おいしそうな りんごが あります。
""",
"""
#N4 #文法12
めがねを かける
めがねを かけた まま
ねて しまった
昨日は めがねを かけた まま  ねて しまいました。

たばこを すう
たばこを すっては いけません
ここで たばこを すっては いけません。

外国へ 行く らしい
昨日 外国へ 行った らしい
田中さんは 昨日 外国へ 行った らしい です。

父が 入院する
父に 入院されて
父に 入院されて、私は とても こまっています。

聞いて
聞いても わかりません。
あの 人の 話は 何回 聞いても わかりません。

ニュースに よると
じしんが ある
じしんが あった そうです。
ニュースに よると、きのう 東京で じしんが あった そうです。
""",
"""
#N4 #文法17
みんなは 私を 笑いました
みんなに わらわれました。
私は へんなことを 言って、みんなに わらわれました。

どんなに 練習しても
うまく なる
どんなに 練習しても、テニスが うまく なりません。

来月 旅行します。
その 時は 車で  行きます。
来月 旅行します。その 時は 車で  行きます。

外国へ 行く
外国へ 行った こと
私は 一度も 外国へ 行った ことがありません。

小説家に なる
しょうらいは 小説家に なる つもり です。

コーヒーか何か どうですか。
コーヒーでも いかがですか。
いっしょに コーヒーでも いかがですか。

中川と 言います。
中川と もうします。
私は 中川と もうします。
""",
"""
#N4 #文法18
聞いた ことがありません。
日本の 音楽は まだ 聞いた ことがありません。

べんりなので
よく 使います。
べんりなので、よくパソコンを 使います。

パンをやく
これから パンをやく ところ です。

できる かどうか
そつぎょうできた かどうか
中田さんが 大学を そつぎょうできた かどうか 知っていますか。

どこに いるか
田中さんが どこに いるか わかりません。

パーティーをする
パーティーをする こと になる
来週 パーティーをする こと になったんです。

スプーンとか ナイフとか
ひきだしには スプーンとか ナイフとかが 入っています。

どちらが 近いですか
この 大学と あの 大学と どちらが 近いですか。
""",
"""
#N4 #文法20
土曜日に して もらえませんか
土曜日に して いただけませんか。
火曜日、木曜日、土曜日に して いただけませんか。

気をつけている
気をつけていたのに
パスポートを なくして
気をつけていたのに、パスポートを なくしてしまいました。

電話するように
かならず 電話するように 言って下さい。

100以上も あります。
東京には 大学が 100以上も あります。

名前を つける
名前を つけて くれる
私に 名前を つけて くれたのは おじいさんです。

大学生の 子どもが います
あの人は 大学生の 子どもが いますが、そうは 見えません。

パーティーが あるかどうか
今晩 パーティーが あるかどうか  教えて ください。

終わったら
仕事が 終わったら、電気を けして ください。
""",
"""
#N4 #文法11
「うみ」と言う
どう 書きますか。
「うみ」と言う 漢字は どう 書きますか。

窓を 開けた まま
窓を 開けた まま  ねたので
かぜを ひく
かぜを ひいて しまいました。
きのうの 夜 窓を 開けた まま  ねたので、かぜを ひいて しまいました。

頭が いたい
ねつが ある
頭が いたいし、ねつが あるから
頭が いたいし、ねつが あるから、今日は 休みます。

たまごの味が する
このおかしは、たまごの味がします。

読む時、めがねを かけます。
父は 新聞を 読む時、いつも めがねを かけます。

話しても かまいません。
ここでは 何を 話しても かまいません。

においが する。
この花、へんな においが します。
""",
"""
#N4 #文法9
食べながら 見ます。
おかしを 食べながら  映画を 見ました。

しずか かもしれません。
あの きっさてんは しずか かもしれません。

雨が ふる
雨が ふるらしい です。
あしたは 雨が ふるらしい です。

おとす
おとした さいふ
さいふが ある
おとした さいふが あって よかったですね。

ひとりで くつが はけるように
むすこは ひとりで くつが はけるように なりました。

「きけん」と 書いてあります。
見て ください。あそこに 「きけん」と 書いてあります。

電車を おりる
電車を おりようと した時
けがを しました。
電車を おりようと した時、ころんで けがを しました。
""",
"""
#N4 #文法2
大きな 音が する
さっき となりの へやで 大きな 音が しました。

行きたい
行きたくない
行きたくなければ
行かない
行かなくても いいです。
いっしょに 行きたくなければ、行かなくても いいです。

ここに来る
ここに来た時
田中さんが あした ここに来た時 聞いてみます。

この漢字は どう 読みますか。

あそんでいるの
子供たちが あそんでいるのが 見えます。

2階に あります
2階に ございます
ネクタイ 売り場は 2階に ございます。

10分で 行けます。
大学まで 歩いて 10分で 行けます。
""",
"""
#N4 #文法15
れきしを しらべる
この町の れきしを しらべる こと
図書館で この町の れきしを しらべる ことができます。

病気に なっても
あの 人は 休みません。
あの 人は 会社を 休みませんでした。
あの 人は 病気に なっても 会社を 休みませんでした。

荷物を 待つ
荷物を お待ちします。
先生、私が 荷物を お待ちします。

味が 悪い
ねだんが 高い
味も 悪いし、ねだんも 高い
この レストランは 味も 悪いし、ねだんも 高いですね。

旅行は どうだった
友だちは「旅行は どうだった」と  私に 聞きました。

おくる
電車に おくれる
電車に おくれる。急げ。
""",
"""
#N4 #文法16
家を こわす
家が こわれる
たくさんの 家が こわれました
大きな 地震で たくさんの 家が こわれました。

朝日が のぼるの
私は 朝日が のぼるのを 見ました。
私は 海で きれいな 朝日が のぼるのを 見ました。

旅行のことを 思い出しました。
楽しかった 旅行のことばかり 思い出しました。

借りるなら
どんな部屋がいいですか。
部屋を借りるなら、どんな部屋がいいですか。

勉強する
勉強したのに
テストのてんが 悪い
テストのてんが 悪かったです。
たくさん 勉強したのに、テストのてんが 悪かったです。

さむいです
きのうほど ではありません。
今日は さむいですが、きのうほど  ではありません。
""",
"""
#N4 #文法1
飲みます
お飲みに なります
先生は 何を お飲みに なりますか。

使います
使い方
おはしの 使い方 を 教えて ください。

飲みます
飲みすぎる
おさけを 飲みすぎました
きのうは ちょっと おさけを 飲みすぎました。
きのう 新しい レストランへ いってみました。

お聞きする
先生に お聞きしたい
先生に お聞きしたいことが あるんですが・・・。

なれる
友だちに なれます
あの 人は だれと でも 友だちに なれます。
""",
"""
#N4 #文法7
子供が 言う
子供に 言われる
たばこを やめることに する
子供に 言われて、私は たばこを やめることに しました。

飲まない
飲まない ことにする
アルコールは もう 飲まない ことにする。

べんりだ
新しいので
べんりだし、新しいので
このアパートは へや代が 高いです。
このアパートは べんりだし、新しいので へや代が 高いです。

来週の かいぎに
出なくても
来週の かいぎには 出なくても  かまいません。

かぜが 強い
かぜが 強いだろう。
たぶん あしたも かぜが 強いだろう。
"""
]
// swiftlint:enable file_length
