//
//  love.swift
//  VoiceOnly
//
//  Created by Wangchou Lu on 9/25/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

let love: [String] = [
// MARK: - デート
"""
#戀愛
なんで|幹嘛？
好きなんだよ|喜歡你啊
好き|喜歡
俺で良ければ付き合ってほしいな|我還可以的話、請和我交往
緊張した|緊張了
ソフトクリーム大好き|愛吃冰淇淋
かき氷とか好きかも|也許喜歡吃刨冰
いいな〜|真好
もう終わり|已經結束了啦
確かに|確實如此
せっかくだからこれやろう？|因為機會難得，去玩這個吧
手をつないでいい？|可以牽手嗎？
私の事どう思ってるの？|你對我有什麼想法？
何で私を選んでくれたの？|為什麼會選我？
今日来てくれてありがとう。|謝謝你今天願意來。
""",
// MARK: - 稱讚
"""
#戀愛 #稱讚
今日の服かわいい|今天的衣服很可愛。
どこで買った？|哪買的啊？
古着屋さん|二手衣店賣的。
可愛かった|真可愛啊
いって良かった|有去真是太好了
嬉しい|真開心
ありがとうございました|謝謝你
今日の感想を書いた手紙|寫著今天感想的信
お手紙嬉しい|信啊～真開心
ビックリした|讓我吃了一驚
すごい嬉しかったです|超開心的～
幸せでした|感到幸福
こんなことしたことない|從沒做過這樣的事
めちゃカワイイ|超可愛！
ちょうどいい|剛剛好。
いい感じ|感覺不錯。
めっちゃキュンキュンした|超讓人心動的。
""",
// MARK: - 告白
"""
#戀愛 #告白
えーと、まず。6日間ありがとうございました。|那個、首先。這六天來謝謝你了。
こちらこそ|我也是。
第一印象から、ずっとさくらちゃんのことが気になって|從第一印象開始，一直對 Sakura 有感覺。
でも、さくらちゃんに言って無かったけど|但雖然沒和Sakura説
正直2日目とか、自分の気持ちをわからなくなって|實際上第二天的時候，自己變的不太懂自己的想法。
ちょっと、悩んだ時期もあったんけど|雖然也有有點苦惱的時候
さくらちゃんに会われへんかった一週間とか|沒能和 Sakura 見面的一週
みんなと会いたい気持ちがなくて、さくらちゃんと会いたい気持ちがあって、ずっと|想和大家見面的想法消失、剩下的是一直想和 Sakura 碰面的想法
3日目と4日目、初めて手を繋いだりして|第三天和第四天、第一次牽手了。
いっぱい2人で過ごして、気になってるの気持ちはもうなくなって|兩個人度過了許多時間，有點在意的心情已經消失了。
好きでいう気持ちしか、なかったです|除了喜歡的心情，其他什麼都沒有。
どうなんところに行きたいと思っている|不管是怎樣的地方都想去
いっぱい思い出を作りたいと思いている|想一起創造很多很多的回憶
俺は、さくらちゃんのことが、大好きです。|我愛上了 Sakura
良かったら、俺と付き合ってほしい。|如果好的話，希望你能和我交往。
えーと、6日間というすごく短い期間だったけど|那個、六天雖然是很短的期間
私も大阪城であった時から|但我從第一次在大阪城碰面時開始
ずっと、圭介のことが気になっていました|一直對健君的事情很在意
はい、けど、6日間だけじゃん|嗯、但是、只有六天啊
知られてないことがまだまだたくさんあるので|因為不知道的事情還有很多
これから、なんだろう。知らなかったことを|從現在起、怎麼說...對於不知道的事情
たくさん知って、いければいいなってと思っています|有深入了解。我想如果能這樣的話很好
私で良かったら、お願いします。お願いします。|如果我可以的話。請多多指教。
ありがとう。お願いします。|謝謝你、請多多指教。
行こうか|走吧。
""",
"""
#戀愛 #關心
今日はどうだった？|今天怎麼樣啊？
今日は早く帰ってきたよ。|今天很早就回家了。
もう家？|已經到家了嗎？
少しよくなった？|有比較好了嗎？
お薬を飲んでね。|記得要吃藥啊。
気をつけて帰ってね。|回家小心。
家に着いたら電話してね。|到家了後打電話給我。
何、飲んでるの？|在喝什麼啊？
ここは良く来るの？|經常來這裡嗎？
すごい！もっと知りたいな|真厲害，想知道更多啊。
やり方を教えてくれる？|能教我怎麼做嗎？
昨日、よく眠れた？|昨天睡得好嗎？
寝坊しちゃった。|睡過頭了。
今日寒くない？|今天是不是很冷？
今電車だよ|現在在電車上呦。
今日はどんな感じよ？|今天有什麼感覺？
""",
"""
#戀愛
わたしたち、ただの友達？|我們只是普通朋友嗎？
圭介といると楽しい。|只要太郎在就覺得開心
もっと圭介のことを知りたい|還想知道更多健君的事
さくらの事をずっと考えている。|一直想著結衣的事。
私たちはうまくいくよ|我們會一直很順利喔。
会いに来てくれないの？|今天不來見我嗎？
もっと会えたらいいのに|如果能更常見面就好了。
真剣に付き合いたいの|我是認真的在交往。
もう一度最初からやり直そう|再一次從頭開始修正吧。
あなたのものじゃない|我不是你的東西。
次いつ会えるの？|下次什麼時候見面？
あと2日で会える！|再兩天就能見面了。
夢で会おうね！|在夢中相見吧。
話したいことがあるんだけど。|有事想跟你說。
早く会いたい！|想早點見到你。
もうすぐ着くよ|馬上就要到啦。
着いたよ！|我到了。
今日はとても楽しかった。ありがとう。|今天真的很開心。謝謝你。
なんかもうすでに寂しいんだけど|怎麼說，已經有點感到寂寞了。
来週も会える？|下個星期也碰面嗎？
"""
]

private let n = """
大成功
つづく
えっ、やろう
怖い怖い怖い
さっき言ってたやつ
恋人見たい
もったない
じゃあ一回さこっちに来て
ここで絶対後ろ振り向かないで
振り向いちゃダメだよ
どういうことで
"""
