//
//  quote.swift
//  今話したい
//
//  Created by Wangchou Lu on 5/2/31 H.
//  Copyright © 31 Heisei Lu, WangChou. All rights reserved.
//

import Foundation

let quote = [
"""
#名言 #動漫1
ただの人間には興味ありません。|我對普通的人類沒有興趣 / 涼宮春日
真実はいつもひとつ|真相只有一個 / 柯南
あんたバカ？|你是白痴嗎? / EVA 明日香
まだまだだね|你還差得遠呢 / 越前龍馬
お前はもう死んでいる|你已經死了 / 拳四郎
禁則事項です|這是禁止事項 / 朝比奈實玖瑠
天才ですから|因為我是天才 / 櫻木花道
私、気になります！|我很好奇! / 千反田愛瑠
本気の失敗には価値がある|認真後的失敗是有價值的 / 南波六太
燃えろ！俺のコスモ！|燃燒吧、我的小宇宙 / 聖鬥士星矢
あきらめたら、そこで試合終了ですよ|要是放棄的話、比賽就等於結束了喔 / 安西教練
やはり俺の青春ラブコメはまちがっている|果然我的青春戀愛喜劇搞錯了。/ 比企谷八幡
めんどくさくない女の子なんていませんよ|不麻煩的女生不存在喔 / 一色伊呂波
10秒だけ持ちこたえてくれ！|幫我撐十秒 / 桐人
僕と契約して、魔法少女になってよ!|和我簽訂契約、成為魔法少女吧 / QB
月に代わっておしおきよ！|我要代替月亮來懲罰你 / 月野兔
わーい！すごい！たのしい！|哇～好厲害～真開心 / 藪貓
ご注文はうさぎですか?|請問你今天要來點兔子嗎？
おれは人間をやめるぞ!|我不想當人類了。/ JOJO的奇妙冒險 - DIO
可愛い象|可愛的好象 / 三顆星的彩色冒險 - COLORS
""",
""",
#名言 #動漫2
大切なのは、過去じゃなくて、今だよ|重要的不是過去、是現在喔 / 田井中律
今いるこの講堂が、私たちの武道館です！|現在在的這個禮堂，就是我們的武道館。/ 平澤唯
カードを一枚伏せ、ターンエンド|我覆蓋一張牌、結束這個回合 / 遊戲王
本当の自由とは、自分のルールで生きるってことなんだよ。|真正的自由是、照自己定的規則活著 / 東大特訓班
言い訳しながら生きてんじゃねよ、てめえの生き方を決めんのはてめえ自身だろ|別邊說著藉口邊活著、決定你的生存方式的人是你自己吧 / 混沌武士 - 無幻
限界はあるものでなく、自分で決めるものでござるよ。|極限不是實際存在的東西、而是由自己決定的 / 緋村劍心
なんだかんだと聞かれたら、答えてあげるのが世の情け|既然你誠心誠意的發問了，我們就大發慈悲的回答你 / 火箭隊
今回で15,498回目に該当する| 這次應是第一萬五千四百九十八次 / 長門有希
あの日見た花の名前を僕達はまだ知らない|我們仍未知道那天所看見的花名
ボールはともだち、こわくないよ|足球是朋友、不可怕喔 / 大空翼
おれの財宝か？欲しけりゃくれてやるぜ… 探してみろ、この世のすべてをそこに置いてきた|我的財寶嗎？想要的話就給你… 去找吧 我把世上的一切都放在那裡了 / 哥爾・D・羅傑
悲しいけど、これって戦争なのよね|雖然很悲哀、但這就是戰爭 / 史雷格·羅
認めたくないものだな、自分自身の若さ故の過ちと言うものを|實在很不想承認，這是我因太年輕而犯下的錯。/機動戰士鋼彈 - 夏亞
逃げるならいつでもできる。だが今しかやれんこともある。|要逃的話隨時都可以。但也有只有現在才能做的事 / 銀魂 - 桂
我が生涯に一片の悔いなし|我的一生沒有任何後悔 / 北斗神拳 - 拉歐
私には今しかないよ、今を生きる女なんだよ|對我來說只有現在、我是活在當下的女子 / 櫻桃小丸子
何かを変えることができる人間がいるとすれば、その人はきっと、大事なものを捨てることができる人だ|如果有能改變什麼的人、那個人一定是能放棄自己重要東西的人 / 進擊的巨人 - 阿爾敏
考えろ。方法はあるはずだ|多想想、一定有辦法的 / 愛德華·艾力克
人が死ぬのはいつだと思う？人に忘れられたときさ！|你認為人什麼時候會死？被人遺忘的時候 / 海賊王 - 希魯魯克
どっちも自分が正しいと思ってるよ。戦争なんてそんなもんだよ|哪邊都認為自己是對的、戰爭就是這樣的東西 / 多啦A夢
""",
// Sentences that Siri failed to recognize
// 放課後ティタイムは、いつまでも、いつまでも、放課後です！|放學後 Tea Time、無論何時、無論何時都是放學後 / 平澤唯
// レムって、誰のこと？|雷姆是誰？ / 愛蜜莉雅
// ゲームクリヤー！|遊戲破關 / 琴葉
// ご飯はお菓子|白飯是配菜 / 平澤唯
"""
#名言 #名人
成功へ向けた具体的な道筋が見えたとき、それはもう成功に等しい|看到前往成功的具體步驟時、那已經等於是成功了。/ 本田圭佑
小さいことを重ねることがとんでもないところに行くただ一つの道だ。|把小的事情重複的累積、是前往不得了地方唯一的路 / 鈴木一朗
夢見ることができれば、それは実現できる。|如果你能看見夢想、就能實現它 / 華特・迪士尼
君が生きるその人生を愛せ、君の愛する人生を生きろ。|愛你過著的人生、活出你愛的人生 / Bob Marley
結婚するやつは馬鹿だ。しないやつは、もっと馬鹿だ。|結婚的人都是笨蛋。不結婚的人更是笨蛋。/ 蕭伯納
われ思う、故にわれあり|我思、故我在 - 笛卡兒
天才とは努力する凡才のことである。|愛因斯坦
逃げ道は行き止まり。|逃避的道路的終點是死路 - 本田望結
未来は今日始まる。明日始まるのではない。|未來是從今天開始、並不是明天開始。/ 教皇 若望保祿二世
高くて硬い壁と、壁にぶつかって割れてしまう卵があるときには、私は常に卵の側に立つ|在高牆和碰到牆就會破裂的雞蛋之間，我總是站在雞蛋這一邊 / 村上春樹
もし今日が人生最後の日だとしたら、今やろうとしていることは本当に自分のやりたいことだろうか？|如果今天是你人生的最後一天，現在在做的事是你自己真的想做的事嗎？ / 史蒂夫·賈伯斯
誰もが犯しやすい間違いは、嫌いな人の存在を認めないことだ。|誰都容易犯的錯是無法認同討厭的人之存在 / 秋元康
人生はマラソンなんだから、百メートルで一等をもらったってしょうがない。|因為人生是馬拉松、一百公尺跑了第一名也不會有獎賞 /　石坂泰三
多数に追随すれば必ず自分を見失う。孤独を恐れず、したいことを続けるしかない。|追隨多數一定會迷失自我。不要怕孤獨，只能持續做想做的事 / 安藤忠雄
人を信じよ、しかしその百倍も自らを信じよ。|相信他人，但更要一百倍地相信自己 / 手塚治蟲
金がないから何もできないという人間は、金があっても何もできない人間である。|說因為沒錢所以什麼都做不了的人、即使有了錢什麼也做不了 / 小林一茶
持てる力を一点に集中させれば、必ず穴があく。|全力向一點集中的話、必定能打出一個洞。/ 鬼塚喜八郎
天は人の上に人を造らず、人の下に人を造らず。|上天不會造人上人、也不會造人下之人。/ 福澤諭吉
多くの場合、諦めてしまう理由は、自分には何の力もないと思ってしまうことだ。|在大多的情況下、放棄的理由是覺得自己已沒有任何力量的想法 / 愛麗絲·華克
""",
"""
#名言 #小說
国境の長いトンネルを抜けると雪国であった|越過國境長長的隧道後、就是雪國了。/ 雪國 - 川康端成
課長！有給休暇これから取っていいですかー|課長、可以從現在開始請特休嗎？ / Golden Slumber - 伊坂幸太郎
生きるべきか死ぬべきか、それが問題だ。|生存還是毀滅、這是個問題。/ 哈姆雷特 - 莎士比亞
吾輩は猫である|我是貓 / 夏目漱石
弱気なこと言う前に、ベストを尽くせよ。いまやれることは、ぜんぶやれよ。|說放棄前、做到自己的最好、現在能做的事全部做完 / 在仙后座的山丘上 - 重松清
人は人を簡単に信じ、簡単に信じられなくなる。|人簡單的就相信一個人、又簡單的變得不相信一個人 / 給夢的女孩 - 綿矢莉莎
春の熊くらい好きだよ|像喜歡春天的熊一樣。/ 挪威的森林 - 村上春樹
私がこの世でいちばん好きな場所は台所だと思う|我認為我在這世界上最喜歡的場所是廚房 / 廚房 - 吉本芭娜娜
かんじんなことは，目に見えないんだよ|真正重要的事物、用肉眼是看不見的 / 小王子
計画のない目標は、ただの願い事にすぎない|沒有計劃的目標就只是個願望 / 小王子
愛、それはただ互いに見つめ合うことではなく、ふたりが同じ方向を見つめることである|愛不是互相對望、而是看著同個方向 / 小王子
どこだっていいんですけど。それならどの道だってかまわんだろ|到哪裡去都沒關係…　那樣的話、走哪條路也都沒有關係吧 / 愛麗絲夢遊仙境
人間は好き嫌いで働くものだ。論法で働くものじゃない。|人是依照自己的好惡而行動、不是照理論而行動的 / 少爺 - 夏目漱石
元気で行こう。絶望するな。 では、失敬。| 有活力的繼續努力吧、不要絕望。那麼、就此告辭 / 津輕 - 太宰治
僕ぼくは自分がなぜ生きていなければならないのか、それが全然わからないのです。|我完全搞不動自己為什麼要活下去 / 斜陽 - 太宰治
""",
"""
#名言 #影劇 ＃無名
野ブタ。パワー注入|注入野豬力量 / 野豬大改造
ここにいろよ。俺の側にいろよ。もうどこにも行くなよ。|留在這裡、留在我的身邊、再也不要去別的地方 / 長假
絶対に半径5メートル以内に近寄らない様にするから|絕對不會靠近你半徑五公尺以內、所以... / 零秒出手
やられたらやり返す。倍返しだ！|人若犯我、以牙還牙。加倍奉還 / 半澤直樹
逃げるは恥だが役に立つ|逃避雖然可恥、但很有用
人は負けた直後、失敗した直後しか他人の言葉が身に染みない|人只有在輸了之後、失敗了之後、才會理解別人說的話 / 龍櫻
奇跡の扉を開く鍵は、お前の心の中にあるんだ。|奇跡之門的鑰匙，就在你的心中 / 求婚大作戰
人生は、必ずしも思うようになるとは限らない。|人生並不一定能隨心所欲 / 羅馬假期
夜明け前が一番暗い|黎明之前最為黑暗
初心忘るべからず。|勿忘初衷
機会を待て。だがけっして時を待つな。|等待機會、但不要等待時間。
苦しい時でも、とにかく笑っていろ。|即使是痛苦的時候、總之要保持笑容。
人に勝つより、自分に勝て。|與其勝過他人、不如勝過自己
昨日から学び、今日を生き、明日へ期待しよう。|向昨天學習、活在當下、期待明天。
花よりも、花を咲かせる土になれ。|與其作為花、不如當讓花開的土壤
人生はいつでも再スタートできる。|人生隨時都可以重新開始
"""
]













