//
//  quote.swift
//  今話したい
//
//  Created by Wangchou Lu on 5/2/31 H.
//  Copyright © 31 Heisei Lu, WangChou. All rights reserved.
//

import Foundation

// MARK: - 情緒表達 1
let quote = [
"""
#名言 #動漫1
ただの人間には興味ありません。|我對普通的人類沒有興趣 - 涼宮春日
真実はいつもひとつ|真相只有一個 - 柯南
あきらめたら、そこで試合終了ですよ|要是放棄的話、比賽就等於結束了喔 - 安西教練
やはり俺の青春ラブコメはまちがっている|果然我的青春戀愛喜劇搞錯了。- 比企谷八幡
めんどくさくない女の子なんていませんよ|不麻煩的女生不存在喔 - 一色伊呂波
あんたバカ？|你是白痴嗎 - EVA 明日香
まだまだだね|你還差得遠呢 - 越前龍馬
本当の自由とは、自分のルールで生きるってことなんだよ。|真正的自由是、照自己定的規則活著 - 東大特訓班
限界はあるものでなく、自分で決めるものでござるよ。|極限不是實際存在的東西、而是由自己決定的- 緋村劍心
ご飯はお菓子|白飯是配菜 - 平澤唯
お前はもう死んでいる|你已經死了 - 拳四郎
10秒だけ持ちこたえてくれ！|幫我撐十秒 - 桐人
月に代わっておしおきよ！|我要代替月亮來懲罰你 - 月野兔
""",
"""
"""
]
