//
//  quote.swift
//  今話したい
//
//  Created by Wangchou Lu on 5/2/31 H.
//  Copyright © 31 Heisei Lu, WangChou. All rights reserved.
//

import Foundation

let quote = [
"""
#名言 #動漫1
ただの人間には興味ありません。|我對普通的人類沒有興趣 / 涼宮春日
真実はいつもひとつ|真相只有一個 / 柯南
あきらめたら、そこで試合終了ですよ|要是放棄的話、比賽就等於結束了喔 / 安西教練
やはり俺の青春ラブコメはまちがっている|果然我的青春戀愛喜劇搞錯了。/ 比企谷八幡
めんどくさくない女の子なんていませんよ|不麻煩的女生不存在喔 / 一色伊呂波
あんたバカ？|你是白痴嗎? / EVA 明日香
まだまだだね|你還差得遠呢 / 越前龍馬
本当の自由とは、自分のルールで生きるってことなんだよ。|真正的自由是、照自己定的規則活著 / 東大特訓班
限界はあるものでなく、自分で決めるものでござるよ。|極限不是實際存在的東西、而是由自己決定的 / 緋村劍心
お前はもう死んでいる|你已經死了 / 拳四郎
10秒だけ持ちこたえてくれ！|幫我撐十秒 / 桐人
月に代わっておしおきよ！|我要代替月亮來懲罰你 / 月野兔
なんだかんだと聞かれたら、答えてあげるのが世の情け|既然你誠心誠意的發問了，我們就大發慈悲的回答你 / 火箭隊
今回で15,498回目に該当する| 這次應是第一萬五千四百九十八次 / 長門有希
わーい！すごい！たのしい！|哇～好厲害～真開心 / 藪貓
あの日見た花の名前を僕達はまだ知らない|我們仍未知道那天所看見的花名
ボールはともだち、こわくないよ|足球是朋友、不可怕喔 / 大空翼
禁則事項です|這是禁止事項 / 朝比奈實玖瑠
天才ですから|因為我是天才 / 櫻木花道
おれの財宝か？欲しけりゃくれてやるぜ… 探してみろ、この世のすべてをそこに置いてきた|我的財寶嗎？想要的話就給你… 去找吧 我把世上的一切都放在那裡了 / 哥爾・D・羅傑
私、気になります！|我很好奇! / 千反田愛瑠
悲しいけど、これって戦争なのよね|雖然很悲哀、但這就是戰爭 / 史雷格·羅
大切なのは、過去じゃなくて、今だよ|重要的不是過去、是現在喔 / 田井中律
今いるこの講堂が、私たちの武道館です！|現在在的這個禮堂，就是我們的武道館。/ 平澤唯
""",
// Sentences that Siri failed to recognize
// 放課後ティタイムは、いつまでも、いつまでも、放課後です！|放學後 Tea Time、無論何時、無論何時都是放學後 / 平澤唯
// レムって、誰のこと？|雷姆是誰？ / 愛蜜莉雅
// ゲームクリヤー！|遊戲破關 / 琴葉
// ご飯はお菓子|白飯是配菜 / 平澤唯
"""
"""
]
