//
//  vocabulary1.swift
//  今話したい
//
//  Created by Wangchou Lu on 12/11/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

import Foundation

//單字
let vocabulary1: [String] = [
// MARK: - 名人
"""
#單字 #名人
織田信長、徳川家康|織田信長、德川家康
夏目漱石、芥川龍之介|夏目漱石、芥川龍之介
木村拓哉、安倍晋三|木村拓哉、安倍晉三
新垣結衣、星野源|新垣結衣、星野源
宇多田光、桑田佳祐|宇多田光、桑田佳祐
綾瀬はるか、江戸川コナン|綾瀬遙、江戶川柯南
宮崎駿、新海誠|宮崎駿、新海誠
大谷翔平、鈴木一朗|大谷翔平、鈴木一朗
伊藤博文、西郷隆盛|伊藤博文、西鄉隆盛
ちびまる子ちゃん、野比のび太|櫻桃小丸子、野比大雄
村上春樹、太宰治|村上春樹、太宰治
櫻井翔、二宮和也|櫻井翔、二宮和也
広瀬すず、阿部寛|廣瀨鈴、阿部寬
堀北真希、内村光良|堀北真希、内村光良
福山雅治、石原さとみ|福山雅治、石原里美
山下智久、戸田恵梨香|山下智久、戶田惠梨香
欅坂46、乃木坂46|櫸坂46、乃木坂46
白石麻衣、西野七瀬|白石麻衣、西野七瀬
""",
// MARK: - 都道府縣
"""
#單字 #都道府縣
北海道、東京都|北海道、東京都
京都府、大阪府|京都府、大阪府
本州、四国|本州、四國
九州、沖縄|九州、沖繩
青森、岩手、宮城|青森、岩手、宮城
秋田、山形、福島|秋田、山形、福島
茨城、栃木、群馬|茨城、栃木、群馬
埼玉、千葉、神奈川|埼玉、千葉、神奈川
新潟、富山、石川|新潟、富山、石川
福井、山梨、長野|福井、山梨、長野
岐阜、静岡、愛知|岐阜、静岡、愛知
三重県、滋賀県、兵庫県|三重、滋賀、兵庫
奈良、和歌山、鳥取|奈良、和歌山、鳥取
島根、岡山、広島|島根、岡山、廣島
山口、徳島、香川|山口、德島、香川
愛媛、高知、福岡|愛媛、高知、福岡
佐賀、長崎、熊本|佐賀、長崎、熊本
大分、宮崎、鹿児島|大分、宮崎、鹿兒島
名古屋市、横浜市|名古屋市、橫濱市
札幌市、仙台市|札幌市、仙台市
""",
// MARK: - 地下鐵站
"""
#單字 #山手線 #駅
東京、神田|東京、神田
秋葉原、御徒町|秋葉原、御徒町
上野、鶯谷|上野、鶯谷
日暮里、西日暮里|日暮里、西日暮里
田端、駒込|田端、駒込
巣鴨、大塚|巢鴨、大塚
池袋、目白|池袋、目白
新大久保、高田馬場|新大久保、高田馬場
新宿、代々木|新宿、代代木
原宿、渋谷|原宿、澀谷
恵比寿、目黒|惠比壽、目黒
五反田、大崎|五反田、大崎
品川、田町|品川、田町
浜松町、新橋|濱松町、新橋
有楽町、日本橋|有樂町、日本橋
浅草橋、蔵前|浅草橋、蔵前
押上、東銀座|押上、東銀座
六本木、霞ケ関|六本木、霞關
日比谷、築地|日比谷、築地
八丁堀、茅場町|八丁堀、茅場町
南千住、神保町|南千住、神保町
""",
// MARK: - 料理
"""
#單字 #料理
塩、砂糖|鹽、糖
包丁、油|菜刀、油
醤油、味噌|醬油、味增
炊飯器、冷蔵庫|電鍋、冰箱
フライパン、鍋|平底鍋、鍋子
米、卵|米、蛋
肉、魚|肉、魚肉
牛肉、豚肉|牛肉、豬肉
鶏肉、野菜|雞肉、蔬菜
ねぎ、玉ねぎ|蔥、洋蔥
ほうれん草、じゃがいも|菠菜、馬鈴薯
人参、きのこ|紅蘿蔔、蘑菇
豆腐、大根|豆腐、白蘿蔔
トマト、白菜|番茄、白菜
キャベツ、スイカ|高麗菜、西瓜
りんご、なし|蘋果、梨子
酒、ビール|酒、啤酒
""",
// MARK: - 家
"""
#單字 #家
テレビ、エアコン|電視、空調
携帯、部屋|房間、手機
目覚まし時計、扇風機|鬧鐘、吹風機
ストーブ、こたつ|暖爐、暖桌
電子レンジ、オーブン|微波爐、烤箱
メガネ、鏡|眼鏡、鏡子
枕、トイレ|枕頭、廁所
タオル、壁|毛巾、牆壁
洗濯機、窓|洗衣機、窗戶
ドア、天井|門、天花板
ゴミ、雑巾|垃圾、抹布
コップ、お皿|杯子、盤子
本棚、机|書架、桌子
暖房、ドライヤー|暖氣、吹風機
パソコン、ラジオ|電腦、收音機
モニター、キーボード|螢幕、鍵盤
ノートパソコン、インターネット|筆電、網路
時計、浴室|時鐘、浴室
監視カメラ、屋根|監視器、屋簷
"""
]
