//
//  vocabulary1.swift
//  今話したい
//
//  Created by Wangchou Lu on 12/11/30 H.
//  Copyright © 30 Heisei Lu, WangChou. All rights reserved.
//

import Foundation

//論述
let vocabulary1: [String] = [
// MARK: - 名人
"""
#單字1 #名人
新垣結衣、星野源|新垣結衣、星野源
安倍晉三、木村拓哉|安倍晉三、木村拓哉
鈴木一朗、大谷翔平|鈴木一朗、大谷翔平
織田信長、徳川家康|織田信長、德川家康
伊藤博文、西郷隆盛|伊藤博文、西鄉隆盛
江戸川コナン、野原しんのすけ|江戶川柯南、野原新之助
ちびまる子ちゃん、野比のび太|櫻桃小丸子、野比大雄
新海誠、宮崎駿|新海誠、宮崎駿
米津玄師、宇多田光|米津玄師、宇多田光
村上春樹、太宰治|村上春樹、太宰治
夏目漱石、芥川龙之介|夏目漱石、芥川龍之介
阿部寛、広瀬すず|阿部寬、廣瀨鈴
櫻井翔、二宮和也|櫻井翔、二宮和也
有村架純、綾瀬はるか|有村架純、綾瀬遙
堀北真希、内村光良|堀北真希、内村光良
福山雅治、石原さとみ|福山雅治、石原里美
桑田佳祐、西野カナ|桑田佳祐、西野加奈
欅坂46、乃木坂46|櫸坂46、乃木坂46
山下智久、戸田恵梨香|山下智久、戶田惠梨香
白石麻衣、西野七瀬|白石麻衣、西野七瀬
""",
// MARK: - 都道府縣
"""
#單字1 #都道府縣
東京都、北海道|東京都、北海道
京都府、大阪府|京都府、大阪府
本州、四国|本州、四國
九州、沖縄|九州、沖繩
青森、岩手、宮城|青森、岩手、宮城
秋田、山形、福島|秋田、山形、福島
茨城、栃木、群馬|茨城、栃木、群馬
埼玉、千葉、神奈川|埼玉、千葉、神奈川
新潟、富山、石川|新潟、富山、石川
福井、山梨、長野|福井、山梨、長野
岐阜、静岡、愛知|岐阜、静岡、愛知
三重、滋賀、兵庫|三重、滋賀、兵庫
奈良、和歌山、鳥取|奈良、和歌山、鳥取
島根、岡山、広島|島根、岡山、廣島
山口、徳島、香川|山口、德島、香川
愛媛、高知、福岡|愛媛、高知、福岡
佐賀、長崎、熊本|佐賀、長崎、熊本
大分、宮崎、鹿児島|大分、宮崎、鹿兒島
名古屋市、横浜市|名古屋市、橫濱市
札幌市、仙台市|札幌市、仙台市
""",
// MARK: - 地下鐵站
"""
#單字1 #山手線 #駅
東京、神田|東京、神田
秋葉原、御徒町|秋葉原、御徒町
上野、鶯谷|上野、鶯谷
日暮里、西日暮里|日暮里、西日暮里
田端、駒込|田端、駒込
巣鴨、大塚|巢鴨、大塚
池袋、目白|池袋、目白
高田馬場、新大久保|高田馬場、新大久保
新宿、代々木|新宿、代代木
原宿、渋谷|原宿、澀谷
恵比寿、目黒|惠比壽、目黒
五反田、大崎|五反田、大崎
品川、田町|品川、田町
浜松町、新橋|濱松町、新橋
有楽町、日本橋|有樂町、日本橋
浅草橋、蔵前|浅草橋、蔵前
押上、東銀座|押上、東銀座
六本木、霞ケ関|六本木、霞關
日比谷、築地|日比谷、築地
八丁堀、茅場町|八丁堀、茅場町
入谷、三ノ輪|入谷、三之輪
南千住、神保町|南千住、神保町
早稲田、神楽坂|早稻田、神樂坂
""",
// MARK: - 料理
"""
#單字1 #料理
塩、砂糖|鹽、糖
油、酢|油、醋
醤油、味噌|醬油、味增
炊飯器、冷蔵庫|電鍋、冰箱
フライパン、鍋|平底鍋、鍋子
包丁、火|菜刀、火
米、卵|米、蛋
肉、魚|肉、魚肉
牛肉、豚肉|牛肉、豬肉
鶏肉、野菜|雞肉、蔬菜
ねぎ、キャベツ、玉ねぎ|蔥、高麗菜、洋蔥
ほうれん草、じゃがいも|菠菜、馬鈴薯
人参、きのこ|紅蘿蔔、蘑菇
豆腐、大根|豆腐、白蘿蔔
トマト、白菜|番茄、白菜
りんご、なし|蘋果、梨子
スイカ、いちご|西瓜、草莓
酒、ビール|酒、啤酒
氷、マグロ|冰、鮪魚
秋刀魚、蛸|秋刀魚、章魚
""",
// MARK: - 家
"""
#單字1 #家
台所、テレビ|廚房、電視
部屋、携帯|房間、手機
ベッド、目覚まし時計|床、鬧鐘
メガネ、鏡|眼鏡、鏡子
枕、トイレ|枕頭、廁所
タオル、歯ブラシ|毛巾、牙刷
蛇口、石鹸|水龍頭、肥皂
便座、壁|馬桶、牆壁
窓、ソファ|窗戶、沙發
ドア、天井|門、天花板
ゆか、エアコン|地板、空調
ゴミ、雑巾|垃圾、抹布
洗濯機、お湯|洗衣機、熱水
リビングルーム、キッチン|客廳、廚房
本棚、机|書架、桌子
椅子、コップ|椅子、杯子
暖房、ドライヤー|暖氣、吹風機
パソコン、電気|電腦、電燈
皿、箸|盤子、筷子
ノートパソコン、インターネット|筆電、網路
"""
]
